In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [15]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [16]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2
# when you are using a list instead of dict, you will find the name of the column as 0,1,2,3 like this...

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [25]:
# we want to add specific names instead of 0,1,2,3
cols = ["name","age","city","salary"]
df2 = pd.DataFrame(data_list,columns = cols)
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

SELECTION & INDEXING OF COLUMNS:

In [27]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
df2["name"]
# single brackets when you want to select a single column

0     John
1     Anna
2    Peter
3    Linda
Name: name, dtype: object

In [ ]:
df2[["name","city"]]
# double brackets when you want to select multiple columns

    name      city
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

CREATING NEW COLUMN:

In [ ]:
df2["designation"] = ["engg","dr","teacher","pilot"]
df2
# adding a new column to the dataframe

    name  age      city  salary designation
0   John   28  New York   65000        engg
1   Anna   34     Paris   70000          dr
2  Peter   29    Berlin   62000     teacher
3  Linda   42    London   85000       pilot

REMOVING COLUMNS:

In [ ]:
df2.drop("designation",axis=1)
# this drops the column 'designation' from the dataframe
# where axis=0 is for rows and axis=1 is for columns

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [47]:
# if we only use drop, then it will never be removed permanently, but to do so, we have to use inplace = True
df2.drop("designation",axis=1,inplace = True)
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [ ]:
df2.drop(["name","city"],axis=1)
# this drops multiple columns but does not do it permanently as inplace is not used

   age  salary
0   28   65000
1   34   70000
2   29   62000
3   42   85000

In [53]:
# removing rows:--------------------
df2.drop(0,axis=0)

    name  age    city  salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

SELECTING ROWS:

In [ ]:
df2.loc[0]
# this will give the first row of the dataframe

name          John
age             28
city      New York
salary       65000
Name: 0, dtype: object

In [ ]:
df2.loc[[1,2]]
# this will give multiple rows at once and the output will be a dataframe btw we are using double brackets here.

    name  age    city  salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000

SELECTING SUBSETS OF ROWS & COLUMNS:

In [ ]:
df[["Age","Salary"]].loc[[0,3]]
# first we selected multiple columns and then multiple rows using double brackets for both selections

   Age  Salary
0   28   65000
3   42   85000

In [ ]:
df2.loc[[0,1]][["city","salary"]]
# another way of doing the same thing as above

       city  salary
0  New York   65000
1     Paris   70000

CONDITIONAL SELECTION:

In [61]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [64]:
# i only want to see those people whose age is above 30
df2[df2["age"] > 30]

    name  age    city  salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [67]:
# i only want to see people whose age is 30  and their city must be in paris:
df2[(df2["age"]>30 ) & (df2["city"] == "Paris")]

   name  age   city  salary
1  Anna   34  Paris   70000